; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(box-has ?box ?content)))
    )
)

; problem
(define (problem drone_problem_d1_l28_p28_c28_g28)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 refugio9 refugio10 refugio11 refugio12 refugio13 refugio14 refugio15 refugio16 refugio17 refugio18 refugio19 refugio20 refugio21 refugio22 refugio23 refugio24 refugio25 refugio26 refugio27 refugio28 - location
	box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 person9 person10 person11 person12 person13 person14 person15 person16 person17 person18 person19 person20 person21 person22 person23 person24 person25 person26 person27 person28 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 comida)
	(at-box box6 deposito)
	(box-has box6 comida)
	(at-box box7 deposito)
	(box-has box7 comida)
	(at-box box8 deposito)
	(box-has box8 comida)
	(at-box box9 deposito)
	(box-has box9 comida)
	(at-box box10 deposito)
	(box-has box10 comida)
	(at-box box11 deposito)
	(box-has box11 comida)
	(at-box box12 deposito)
	(box-has box12 comida)
	(at-box box13 deposito)
	(box-has box13 comida)
	(at-box box14 deposito)
	(box-has box14 comida)
	(at-box box15 deposito)
	(box-has box15 medicina)
	(at-box box16 deposito)
	(box-has box16 medicina)
	(at-box box17 deposito)
	(box-has box17 medicina)
	(at-box box18 deposito)
	(box-has box18 medicina)
	(at-box box19 deposito)
	(box-has box19 medicina)
	(at-box box20 deposito)
	(box-has box20 medicina)
	(at-box box21 deposito)
	(box-has box21 medicina)
	(at-box box22 deposito)
	(box-has box22 medicina)
	(at-box box23 deposito)
	(box-has box23 medicina)
	(at-box box24 deposito)
	(box-has box24 medicina)
	(at-box box25 deposito)
	(box-has box25 medicina)
	(at-box box26 deposito)
	(box-has box26 medicina)
	(at-box box27 deposito)
	(box-has box27 medicina)
	(at-box box28 deposito)
	(box-has box28 medicina)
	(at-person person1 refugio8)
	(at-person person2 refugio23)
	(at-person person3 refugio23)
	(at-person person4 refugio17)
	(at-person person5 refugio6)
	(at-person person6 refugio1)
	(at-person person7 refugio6)
	(at-person person8 refugio26)
	(at-person person9 refugio21)
	(at-person person10 refugio26)
	(at-person person11 refugio17)
	(at-person person12 refugio5)
	(at-person person13 refugio2)
	(at-person person14 refugio15)
	(at-person person15 refugio22)
	(at-person person16 refugio15)
	(at-person person17 refugio20)
	(at-person person18 refugio5)
	(at-person person19 refugio23)
	(at-person person20 refugio9)
	(at-person person21 refugio14)
	(at-person person22 refugio17)
	(at-person person23 refugio2)
	(at-person person24 refugio24)
	(at-person person25 refugio15)
	(at-person person26 refugio20)
	(at-person person27 refugio13)
	(at-person person28 refugio14)
)

(:goal (and
	(person-has person1 medicina)
	(person-has person3 comida)
	(person-has person4 comida)
	(person-has person5 medicina)
	(person-has person6 medicina)
	(person-has person7 comida)
	(person-has person7 medicina)
	(person-has person8 medicina)
	(person-has person9 comida)
	(person-has person10 medicina)
	(person-has person13 medicina)
	(person-has person14 comida)
	(person-has person14 medicina)
	(person-has person15 comida)
	(person-has person16 comida)
	(person-has person16 medicina)
	(person-has person18 comida)
	(person-has person18 medicina)
	(person-has person19 medicina)
	(person-has person20 medicina)
	(person-has person21 comida)
	(person-has person21 medicina)
	(person-has person23 comida)
	(person-has person24 comida)
	(person-has person24 medicina)
	(person-has person25 comida)
	(person-has person26 comida)
	(person-has person28 comida)
))
)

; plan
1. (pick box28 deposito dron1-der dron1)
   deleted: (at-box box28 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box28)
   goals met: 0 of 28
2. (pick box14 deposito dron1-izq dron1)
   deleted: (at-box box14 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box14)
   goals met: 0 of 28
3. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 0 of 28
4. (leave box28 refugio8 dron1-der dron1 person1 medicina)
   deleted: (carrying dron1 dron1-der box28) (box-has box28 medicina)
   added: (at-box box28 refugio8) (free dron1-der) (person-has person1 medicina)
   goals met: 1 of 28
5. (move refugio8 deposito dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 deposito)
   goals met: 1 of 28
6. (pick box27 deposito dron1-der dron1)
   deleted: (at-box box27 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box27)
   goals met: 1 of 28
7. (move deposito refugio17 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio17)
   goals met: 1 of 28
8. (leave box14 refugio17 dron1-izq dron1 person4 comida)
   deleted: (carrying dron1 dron1-izq box14) (box-has box14 comida)
   added: (at-box box14 refugio17) (free dron1-izq) (person-has person4 comida)
   goals met: 2 of 28
9. (move refugio17 deposito dron1)
   deleted: (at-dron dron1 refugio17)
   added: (at-dron dron1 deposito)
   goals met: 2 of 28
10. (pick box13 deposito dron1-izq dron1)
   deleted: (at-box box13 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box13)
   goals met: 2 of 28
11. (move deposito refugio1 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio1)
   goals met: 2 of 28
12. (leave box27 refugio1 dron1-der dron1 person6 medicina)
   deleted: (carrying dron1 dron1-der box27) (box-has box27 medicina)
   added: (at-box box27 refugio1) (free dron1-der) (person-has person6 medicina)
   goals met: 3 of 28
13. (move refugio1 deposito dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 deposito)
   goals met: 3 of 28
14. (pick box26 deposito dron1-der dron1)
   deleted: (at-box box26 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box26)
   goals met: 3 of 28
15. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 3 of 28
16. (move refugio6 refugio21 dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 refugio21)
   goals met: 3 of 28
17. (leave box13 refugio21 dron1-izq dron1 person9 comida)
   deleted: (carrying dron1 dron1-izq box13) (box-has box13 comida)
   added: (at-box box13 refugio21) (free dron1-izq) (person-has person9 comida)
   goals met: 4 of 28
18. (move refugio21 deposito dron1)
   deleted: (at-dron dron1 refugio21)
   added: (at-dron dron1 deposito)
   goals met: 4 of 28
19. (pick box12 deposito dron1-izq dron1)
   deleted: (at-box box12 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box12)
   goals met: 4 of 28
20. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 4 of 28
21. (move refugio6 refugio22 dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 refugio22)
   goals met: 4 of 28
22. (leave box12 refugio22 dron1-izq dron1 person15 comida)
   deleted: (carrying dron1 dron1-izq box12) (box-has box12 comida)
   added: (at-box box12 refugio22) (free dron1-izq) (person-has person15 comida)
   goals met: 5 of 28
23. (move refugio22 deposito dron1)
   deleted: (at-dron dron1 refugio22)
   added: (at-dron dron1 deposito)
   goals met: 5 of 28
24. (pick box11 deposito dron1-izq dron1)
   deleted: (at-box box11 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box11)
   goals met: 5 of 28
25. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 5 of 28
26. (move refugio6 refugio9 dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 refugio9)
   goals met: 5 of 28
27. (leave box26 refugio9 dron1-der dron1 person20 medicina)
   deleted: (carrying dron1 dron1-der box26) (box-has box26 medicina)
   added: (at-box box26 refugio9) (free dron1-der) (person-has person20 medicina)
   goals met: 6 of 28
28. (move refugio9 deposito dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 deposito)
   goals met: 6 of 28
29. (pick box25 deposito dron1-der dron1)
   deleted: (at-box box25 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box25)
   goals met: 6 of 28
30. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 6 of 28
31. (move refugio6 refugio20 dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 refugio20)
   goals met: 6 of 28
32. (leave box11 refugio20 dron1-izq dron1 person26 comida)
   deleted: (carrying dron1 dron1-izq box11) (box-has box11 comida)
   added: (at-box box11 refugio20) (free dron1-izq) (person-has person26 comida)
   goals met: 7 of 28
33. (move refugio20 deposito dron1)
   deleted: (at-dron dron1 refugio20)
   added: (at-dron dron1 deposito)
   goals met: 7 of 28
34. (pick box10 deposito dron1-izq dron1)
   deleted: (at-box box10 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box10)
   goals met: 7 of 28
35. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 7 of 28
36. (leave box25 refugio6 dron1-der dron1 person5 medicina)
   deleted: (carrying dron1 dron1-der box25) (box-has box25 medicina)
   added: (at-box box25 refugio6) (free dron1-der) (person-has person5 medicina)
   goals met: 8 of 28
37. (move refugio6 deposito dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 deposito)
   goals met: 8 of 28
38. (pick box24 deposito dron1-der dron1)
   deleted: (at-box box24 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box24)
   goals met: 8 of 28
39. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 8 of 28
40. (leave box10 refugio6 dron1-izq dron1 person7 comida)
   deleted: (carrying dron1 dron1-izq box10) (box-has box10 comida)
   added: (at-box box10 refugio6) (free dron1-izq) (person-has person7 comida)
   goals met: 9 of 28
41. (move refugio6 deposito dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 deposito)
   goals met: 9 of 28
42. (pick box9 deposito dron1-izq dron1)
   deleted: (at-box box9 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box9)
   goals met: 9 of 28
43. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 9 of 28
44. (leave box24 refugio6 dron1-der dron1 person7 medicina)
   deleted: (carrying dron1 dron1-der box24) (box-has box24 medicina)
   added: (at-box box24 refugio6) (free dron1-der) (person-has person7 medicina)
   goals met: 10 of 28
45. (move refugio6 deposito dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 deposito)
   goals met: 10 of 28
46. (pick box23 deposito dron1-der dron1)
   deleted: (at-box box23 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box23)
   goals met: 10 of 28
47. (move deposito refugio26 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio26)
   goals met: 10 of 28
48. (leave box23 refugio26 dron1-der dron1 person8 medicina)
   deleted: (carrying dron1 dron1-der box23) (box-has box23 medicina)
   added: (at-box box23 refugio26) (free dron1-der) (person-has person8 medicina)
   goals met: 11 of 28
49. (move refugio26 deposito dron1)
   deleted: (at-dron dron1 refugio26)
   added: (at-dron dron1 deposito)
   goals met: 11 of 28
50. (pick box22 deposito dron1-der dron1)
   deleted: (at-box box22 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box22)
   goals met: 11 of 28
51. (move deposito refugio26 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio26)
   goals met: 11 of 28
52. (leave box22 refugio26 dron1-der dron1 person10 medicina)
   deleted: (carrying dron1 dron1-der box22) (box-has box22 medicina)
   added: (at-box box22 refugio26) (free dron1-der) (person-has person10 medicina)
   goals met: 12 of 28
53. (move refugio26 deposito dron1)
   deleted: (at-dron dron1 refugio26)
   added: (at-dron dron1 deposito)
   goals met: 12 of 28
54. (pick box21 deposito dron1-der dron1)
   deleted: (at-box box21 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box21)
   goals met: 12 of 28
55. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 12 of 28
56. (leave box9 refugio5 dron1-izq dron1 person18 comida)
   deleted: (carrying dron1 dron1-izq box9) (box-has box9 comida)
   added: (at-box box9 refugio5) (free dron1-izq) (person-has person18 comida)
   goals met: 13 of 28
57. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 13 of 28
58. (pick box8 deposito dron1-izq dron1)
   deleted: (at-box box8 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box8)
   goals met: 13 of 28
59. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 13 of 28
60. (leave box21 refugio5 dron1-der dron1 person18 medicina)
   deleted: (carrying dron1 dron1-der box21) (box-has box21 medicina)
   added: (at-box box21 refugio5) (free dron1-der) (person-has person18 medicina)
   goals met: 14 of 28
61. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 14 of 28
62. (pick box20 deposito dron1-der dron1)
   deleted: (at-box box20 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box20)
   goals met: 14 of 28
63. (move deposito refugio23 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio23)
   goals met: 14 of 28
64. (leave box8 refugio23 dron1-izq dron1 person3 comida)
   deleted: (carrying dron1 dron1-izq box8) (box-has box8 comida)
   added: (at-box box8 refugio23) (free dron1-izq) (person-has person3 comida)
   goals met: 15 of 28
65. (move refugio23 deposito dron1)
   deleted: (at-dron dron1 refugio23)
   added: (at-dron dron1 deposito)
   goals met: 15 of 28
66. (pick box7 deposito dron1-izq dron1)
   deleted: (at-box box7 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box7)
   goals met: 15 of 28
67. (move deposito refugio23 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio23)
   goals met: 15 of 28
68. (leave box20 refugio23 dron1-der dron1 person19 medicina)
   deleted: (carrying dron1 dron1-der box20) (box-has box20 medicina)
   added: (at-box box20 refugio23) (free dron1-der) (person-has person19 medicina)
   goals met: 16 of 28
69. (move refugio23 deposito dron1)
   deleted: (at-dron dron1 refugio23)
   added: (at-dron dron1 deposito)
   goals met: 16 of 28
70. (pick box19 deposito dron1-der dron1)
   deleted: (at-box box19 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box19)
   goals met: 16 of 28
71. (move deposito refugio2 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio2)
   goals met: 16 of 28
72. (leave box19 refugio2 dron1-der dron1 person13 medicina)
   deleted: (carrying dron1 dron1-der box19) (box-has box19 medicina)
   added: (at-box box19 refugio2) (free dron1-der) (person-has person13 medicina)
   goals met: 17 of 28
73. (move refugio2 deposito dron1)
   deleted: (at-dron dron1 refugio2)
   added: (at-dron dron1 deposito)
   goals met: 17 of 28
74. (pick box18 deposito dron1-der dron1)
   deleted: (at-box box18 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box18)
   goals met: 17 of 28
75. (move deposito refugio2 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio2)
   goals met: 17 of 28
76. (leave box7 refugio2 dron1-izq dron1 person23 comida)
   deleted: (carrying dron1 dron1-izq box7) (box-has box7 comida)
   added: (at-box box7 refugio2) (free dron1-izq) (person-has person23 comida)
   goals met: 18 of 28
77. (move refugio2 deposito dron1)
   deleted: (at-dron dron1 refugio2)
   added: (at-dron dron1 deposito)
   goals met: 18 of 28
78. (pick box6 deposito dron1-izq dron1)
   deleted: (at-box box6 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box6)
   goals met: 18 of 28
79. (move deposito refugio24 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio24)
   goals met: 18 of 28
80. (leave box6 refugio24 dron1-izq dron1 person24 comida)
   deleted: (carrying dron1 dron1-izq box6) (box-has box6 comida)
   added: (at-box box6 refugio24) (free dron1-izq) (person-has person24 comida)
   goals met: 19 of 28
81. (move refugio24 deposito dron1)
   deleted: (at-dron dron1 refugio24)
   added: (at-dron dron1 deposito)
   goals met: 19 of 28
82. (pick box5 deposito dron1-izq dron1)
   deleted: (at-box box5 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box5)
   goals met: 19 of 28
83. (move deposito refugio24 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio24)
   goals met: 19 of 28
84. (leave box18 refugio24 dron1-der dron1 person24 medicina)
   deleted: (carrying dron1 dron1-der box18) (box-has box18 medicina)
   added: (at-box box18 refugio24) (free dron1-der) (person-has person24 medicina)
   goals met: 20 of 28
85. (move refugio24 deposito dron1)
   deleted: (at-dron dron1 refugio24)
   added: (at-dron dron1 deposito)
   goals met: 20 of 28
86. (pick box17 deposito dron1-der dron1)
   deleted: (at-box box17 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box17)
   goals met: 20 of 28
87. (move deposito refugio15 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio15)
   goals met: 20 of 28
88. (leave box5 refugio15 dron1-izq dron1 person14 comida)
   deleted: (carrying dron1 dron1-izq box5) (box-has box5 comida)
   added: (at-box box5 refugio15) (free dron1-izq) (person-has person14 comida)
   goals met: 21 of 28
89. (move refugio15 deposito dron1)
   deleted: (at-dron dron1 refugio15)
   added: (at-dron dron1 deposito)
   goals met: 21 of 28
90. (pick box4 deposito dron1-izq dron1)
   deleted: (at-box box4 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box4)
   goals met: 21 of 28
91. (move deposito refugio15 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio15)
   goals met: 21 of 28
92. (leave box17 refugio15 dron1-der dron1 person14 medicina)
   deleted: (carrying dron1 dron1-der box17) (box-has box17 medicina)
   added: (at-box box17 refugio15) (free dron1-der) (person-has person14 medicina)
   goals met: 22 of 28
93. (move refugio15 deposito dron1)
   deleted: (at-dron dron1 refugio15)
   added: (at-dron dron1 deposito)
   goals met: 22 of 28
94. (pick box16 deposito dron1-der dron1)
   deleted: (at-box box16 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box16)
   goals met: 22 of 28
95. (move deposito refugio15 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio15)
   goals met: 22 of 28
96. (leave box4 refugio15 dron1-izq dron1 person16 comida)
   deleted: (carrying dron1 dron1-izq box4) (box-has box4 comida)
   added: (at-box box4 refugio15) (free dron1-izq) (person-has person16 comida)
   goals met: 23 of 28
97. (move refugio15 deposito dron1)
   deleted: (at-dron dron1 refugio15)
   added: (at-dron dron1 deposito)
   goals met: 23 of 28
98. (pick box3 deposito dron1-izq dron1)
   deleted: (at-box box3 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box3)
   goals met: 23 of 28
99. (move deposito refugio15 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio15)
   goals met: 23 of 28
100. (leave box16 refugio15 dron1-der dron1 person16 medicina)
   deleted: (carrying dron1 dron1-der box16) (box-has box16 medicina)
   added: (at-box box16 refugio15) (free dron1-der) (person-has person16 medicina)
   goals met: 24 of 28
101. (move refugio15 deposito dron1)
   deleted: (at-dron dron1 refugio15)
   added: (at-dron dron1 deposito)
   goals met: 24 of 28
102. (pick box15 deposito dron1-der dron1)
   deleted: (at-box box15 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box15)
   goals met: 24 of 28
103. (move deposito refugio15 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio15)
   goals met: 24 of 28
104. (move refugio15 refugio14 dron1)
   deleted: (at-dron dron1 refugio15)
   added: (at-dron dron1 refugio14)
   goals met: 24 of 28
105. (leave box15 refugio14 dron1-der dron1 person21 medicina)
   deleted: (carrying dron1 dron1-der box15) (box-has box15 medicina)
   added: (at-box box15 refugio14) (free dron1-der) (person-has person21 medicina)
   goals met: 25 of 28
106. (move refugio14 refugio15 dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 refugio15)
   goals met: 25 of 28
107. (leave box3 refugio15 dron1-izq dron1 person25 comida)
   deleted: (carrying dron1 dron1-izq box3) (box-has box3 comida)
   added: (at-box box3 refugio15) (free dron1-izq) (person-has person25 comida)
   goals met: 26 of 28
108. (move refugio15 deposito dron1)
   deleted: (at-dron dron1 refugio15)
   added: (at-dron dron1 deposito)
   goals met: 26 of 28
109. (pick box2 deposito dron1-der dron1)
   deleted: (at-box box2 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box2)
   goals met: 26 of 28
110. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 26 of 28
111. (leave box2 refugio14 dron1-der dron1 person21 comida)
   deleted: (carrying dron1 dron1-der box2) (box-has box2 comida)
   added: (at-box box2 refugio14) (free dron1-der) (person-has person21 comida)
   goals met: 27 of 28
112. (move refugio14 deposito dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 deposito)
   goals met: 27 of 28
113. (pick box1 deposito dron1-der dron1)
   deleted: (at-box box1 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box1)
   goals met: 27 of 28
114. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 27 of 28
115. (leave box1 refugio14 dron1-der dron1 person28 comida)
   deleted: (carrying dron1 dron1-der box1) (box-has box1 comida)
   added: (at-box box1 refugio14) (free dron1-der) (person-has person28 comida)
   goals met: 28 of 28
